src/cf/Enums/ЭлементыЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЭлементыЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МатериальныеЗатраты</Name>
					<Comment>Строка 5610</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
					<Comment>Строка 5620</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчисленияНаСоциальныеНужды</Name>
					<Comment>Строка 5630</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Амортизация</Name>
					<Comment>Строка 5640</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеЗатраты</Name>
					<Comment>Строка 5650</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ЭлементыЗатрат/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция КорСчета() Экспорт
	
	КорСчета = Новый ТаблицаЗначений;
	КорСчета.Колонки.Добавить("Элемент", Новый ОписаниеТипов("ПеречислениеСсылка.ЭлементыЗатрат"));
	КорСчета.Колонки.Добавить("КорСчет", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	
	// Материалы
	// 10, 21, 41, 43, 45
	ДобавитьСубсчета(КорСчета, МатериальныеЗатраты, ПланыСчетов.Хозрасчетный.Материалы);
	ДобавитьСубсчета(КорСчета, МатериальныеЗатраты, ПланыСчетов.Хозрасчетный.Полуфабрикаты);
	ДобавитьСубсчета(КорСчета, МатериальныеЗатраты, ПланыСчетов.Хозрасчетный.Товары);
	ДобавитьСубсчета(КорСчета, МатериальныеЗатраты, ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
	ДобавитьСубсчета(КорСчета, МатериальныеЗатраты, ПланыСчетов.Хозрасчетный.ТоварыОтгруженные);
	
	// Оплата труда
	ДобавитьСубсчета(КорСчета, ОплатаТруда, ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
	
	// Социальные налоги
	ДобавитьСубсчета(КорСчета, ОтчисленияНаСоциальныеНужды, ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию);
	
	// Амортизация
	ДобавитьСубсчета(КорСчета, Амортизация, ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств);
	ДобавитьСубсчета(КорСчета, Амортизация, ПланыСчетов.Хозрасчетный.НематериальныеАктивы);
	ДобавитьСубсчета(КорСчета, Амортизация, ПланыСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов);
	
	Возврат КорСчета;
	
КонецФункции

Процедура ДобавитьСубсчета(КорСчета, Элемент, Счет)
	
	Для Каждого Субсчет Из БухгалтерскийУчетВызовСервераПовтИсп.СчетаВИерархии(Счет) Цикл
		НоваяСтрока = КорСчета.Добавить();
		НоваяСтрока.Элемент = Элемент;
		НоваяСтрока.КорСчет = Субсчет;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
